/*
create table address (
id bigserial not null,
user_id integer not null,
zip_code varchar(30),
city varchar(30),
street varchar(30),
building varchar(30),
flat varchar(30),
primary key(id)
);

alter table address add constraint FK_address_tbl_1 foreign key (user_id) references mars;

insert into address (user_id, zip_code, city, street, building, flat) values
('1', '295014', 'Симферополь', 'Киевская', '1', '39'),
('2', '295033', 'Симферополь', 'Луговая', '2', '83'),
('3', '295051', 'Симферополь', 'Маяковского', '3', '16'),
('4', '295022', 'Симферополь', 'Арабатская', '4', '14'),
('5', '295013', 'Симферополь', 'Батурина', '5', '23'),
('6', '295050', 'Симферополь', 'Вишнёвая', '6', '45'),
('7', '295017', 'Симферополь', 'Воровского', '7', '11'),
('8', '295094', 'Симферополь', 'Гагарина', '8', '30'),
('9', '295000', 'Симферополь', 'Долгоруковская', '9', '1'),
('10', '295034', 'Симферополь', 'Евпаторийское шоссе', '13', '16'),
('11', '295494', 'Симферополь', 'Жуковского', '29', '55'),
('12', '295048', 'Симферополь', 'Зенитная', '42', '23'),
('13', '295024', 'Симферополь', 'Кавказская', '2', '19'),
('14', '295024', 'Симферополь', 'Кечкеметская', '4', '33'),
('15', '295049', 'Симферополь', 'Ленина', '14', '38'),
('16', '295094', 'Симферополь', 'Партизанская', '22', '7'),
('17', '295034', 'Симферополь', 'Лермонтова', '24', '92'),
('18', '295050', 'Симферополь', 'Молодежная', '5', '19'),
('19', '295026', 'Симферополь', 'Лескова', '72', '10'),
('20', '295014', 'Симферополь', 'Москалева', '34', '83'),
('22', '295010', 'Симферополь', 'Набережная', '43', '94'),
('22', '295429', 'Симферополь', 'Нестерова', '3', '18'),
('23', '295000', 'Симферополь', 'Октябрьская', '26', '39'),
('24', '295022', 'Симферополь', 'Павленко', '8', '64'),
('1', '295029', 'Симферополь', 'Петровская балка', '36', '30'),
('26', '295018', 'Симферополь', 'Ракетная', '32', '21'),
('27', '295417', 'Симферополь', 'Русская', '8', '18'),
('28', '295029', 'Симферополь', 'Тарабукина', '18', '63'),
('29', '295023', 'Симферополь', 'Народная', '10', '17'),
('30', '295053', 'Симферополь', 'Лебедева', '29', '45'),
('31', '295001', 'Симферополь', 'Коммунальная', '2', '19'),
('32', '295051', 'Симферополь', 'Калинина', '32', '49'),
('33', '295035', 'Симферополь', 'Железнодорожная', '7', '52'),
('34', '295035', 'Симферополь', 'Донская', '2', '33'),
('35', '295007', 'Симферополь', 'Ломоносова', '6', '28'),
('30', '295007', 'Симферополь', 'Рылеева', '20', '51'),
('20', '295029', 'Симферополь', 'Севастопольская', '8', '62'),
('10', '295000', 'Симферополь', 'Одесская', '34', '95');

---  
select u.first_name, u.middle_name, u.last_name, a.zip_code, 
a.city, a.street, a.building, a.flat from mars u 
inner join address a on u.id=a.user_id

select u.first_name, u.middle_name, u.last_name, a.zip_code, 
a.city, a.street, a.building, a.flat from mars u 
left join address a on u.id=a.user_id

select m.first_name, m.middle_name, m.last_name, m.e_mail, g.name
from group_member gm join university_member um on gm.university_member_id=um.user_id
join groups g on gm.group_id=g.id join mars m on um.user_id=m.id;

select m.first_name, m.middle_name, m.last_name, m.e_mail, d.name
from university_member um join mars m on um.user_id=m.id
join department d on um.department_id=d.id;

select m.first_name, m.middle_name, m.last_name, m.e_mail, p.name 
from university_member um join mars m on um.user_id=m.id
join position p on um.position_id=p.id;
*/