/*
insert into mars (e_mail,first_name, last_name, middle_name, birth_date, phone, role_name) values
('vinogradovav@mail.ru','Вера','Александровна', 'Виноградова','2000-08-22','+7(978)-630-12-38', 'user'),
('maximovand@mail.ru','Ульяна','Ярославовна', 'Максимова','2001-01-15','+7(978)301-27-43', 'user'),
('naumovad@mail.ru','Дарья','Антоновна', 'Наумова','2001-10-09','+7(978)096-39-12', 'user'),
('chesnokovA@mail.ru','Андрей','Максимович', 'Чесноков','2002-11-18','+7(978)927-41-04', 'user'),
('popovaYana@mail.ru','Яна','Ильинична', 'Попова','2000-09-02','+7(978)835-64-83', 'user'),
('safonovGeorgiy@mail.ru','Георгий','Андреевич', 'Сафонов','2001-05-10','+7(978)749-26-21', 'user'),
('smirnovaMilana@mail.ru','Милана','Александровна', 'Виноградова','2000-08-22','+7(978)459-33-12', 'user'),
('voronovR@mail.ru','Роман','Максимович', 'Воронов','2002-02-23','+7(978)578-32-59', 'user'),
('bezrukovaS@mail.ru','Софья','Фёдоровна', 'Безрукова','2001-06-12','+7(978)912-87-23', 'user'),
('kasyanovMiron@mail.ru','Мирон','Маркович', 'Касьянов','2000-12-08','+7(978)382-33-21', 'user');
/*


