/*
insert into mars (e_mail, first_name, last_name, middle_name, birth_date, phone, role_name) values
('anisimovV@mail.ru','Анисимов','Владимир','Борисович','12-09-1998','+7(978)384-45-43','user'),
('baranovayulia@mail.ru','Баранова','Юлия','Александровна','31-10-2000','+7(978)349-22-29','user'),
('ovchinnikovM@mail.ru','Овчинников','Максим','Артёмович','04-02-1999','+7(978)293-29-28','user'),
('belikovanton@mail.ru','Беликов','Антон','Михайлович','06-11-2001','+7(978)332-18-26','user'),
('vasilevaarina@mail.ru','Васильева','Арина','Степановна','28-08-2002','+7(978)946-24-94','user'),
('kostinaAnastasiya@mail.ru','Костина','Анастасия','Николаевна','16-05-1997','+7(978)309-48-19','user'),
('fedorovstenan@mail.ru','Фёдоров','Степан','Алексеевич','14-06-1998','+7(978)436-27-49','user'),
('titovm@mail.ru','Титов','Михаил','Иванович','29-11-1999','+7(978)583-48-38','user'),
('frolovamaria23@mail.ru','Фролова','Мария','Вячеславовна','12-04-2000','+7(978)896-59-34','user'),
('ivancherhysh@mail.ru','Чёрных','Иван','Даниилович','19-10-1998','+7(978)605-38-74','user');
*/

